package seemygo数据结构_算法.algorithm.graph;

public class Data {
    //广度优先搜索
    public static final Object[][]BFS_01={
            {"a","b"},{"a","f"},
            {"b","c"},{"b","i"},{"b","g"},
            {"c","i"},{"c","d"},
            {"d","i"},{"d","g"},{"d","e"},{"d","h"},
            {"e","h"},{"e","f"},
            {"f","g"},
            {"g","h"},
    };
    //广度优先搜索
    public static final Object[][]BFS_02={
            {0,1},{0,4},
            {1,2},
            {2,0},{2,4},{2,5},
            {3,1},
            {4,6},{4,7},
            {5,3},{5,7},
            {6,2},{6,7},
    };

    //深度优先
    public static final Object[][]DFS_01={
            {0,1},
            {1,3},{1,5},{1,6},{1,2},
            {2,4},
            {3,7},
    };
    //深度优先
    public static final Object[][]DFS_02={
            {"a","b"},{"a","e"},
            {"b","e"},
            {"c","b"},
            {"d","a"},
            {"e","c"},{"e","f"},
            {"f","c"},
    };
    //拓扑排序 有向无环图
    public static final Object[][]TOPO={
            {0,2},
            {1,0},
            {2,5},{2,6},
            {3,1},{3,5},{3,7},
            {5,7},
            {6,4},
            {7,6},
    };
    //有权图
    public static final Object[][]NST_01 ={
            {0,2,2},{0,4,7},
            {1,2,3},{1,5,1},{1,6,7},
            {2,4,4},{2,5,3},{2,6,6},
            {3,7,9},
            {4,6,8},
            {5,6,4},{5,7,5},
    };

    //有权图
    public static final Object[][]NST_02={
            {"a","b",17},{"a","f",1},{"a","e",16},
            {"b","d",6},{"b","d",5},{"b","f",11},
            {"c","d",10},
            {"d","e",4},{"d","f",14},
            {"e","f",33},
    };
}
